Revit 2027 API
Subelement.Create Method
 Creates an object representing element or subelement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Subelement Create(
	Document aDoc,
	Reference reference
)
Public Shared Function Create (
	aDoc As Document,
	reference As Reference
) As Subelement
public:
static Subelement^ Create(
	Document^ aDoc,
	Reference^ reference
)
static member Create :
        aDoc : Document *
        reference : Reference -> Subelement
Parameters
aDoc Document
 The document.
reference Reference
 The reference that identifies element or subelement.
Return Value
Subelement
 The newly created subelement.
Exceptions
Exception | Condition
ArgumentException |  reference does not identify a valid element or subelement.
ArgumentNullException |  A non-optional argument was null
Remarks
 If %reference% points to linked document:
 The GetReference() method of the newly created subelement will return the local reference in the linked document.
 The Document property of the newly created subelement will return the linked document.
See Also
Reference
Subelement Class
Autodesk.Revit.DB Namespace